Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase Methods
The DrawingEnumeratorBase type exposes the following members.
Methods
Name | Description
GetEnumerator
 Allows the usage of the foreach statement with DrawingObjectEnumerator.
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace